### loading the data

In [1]:
import numpy as np
import pandas as pd

### loading user id data

In [3]:
user_data = open("user.dat","r").read()

**--> Making Dataframe with Id and Name**

In [73]:
a = ""
for i in user_data:
    if i.isalnum():
        a += i
    else:
        a += " "
a = a.split()
name = [a[i] for i in range(len(a)) if i%2==0]
user_id = [int(a[i]) for i in range(len(a)) if i%2==1]
user = dict(zip(user_id,name))
user_df = pd.DataFrame(user.values(),index=user.keys())
user_df.reset_index(inplace=True)
user_df.rename(columns={0:"Name","index":"id"},inplace=True)
user_df

    id       Name
0    1     Saheba
1    2     Lokesh
2    3     Hemant
3    4   Abhishek
4    5    Kuldeep
5    6        Dev
6    7  Siddharth
7    8       Ajay
8    9     Sachin
9   10      Varun
10  11      Priya
11  12      Bantu
12  13     Saloni
13  14   Priyanka
14  15     Govind
15  16      Purvi
16  17       Moiz
17  18    Gayatri
18  19   Shivangi
19  20      Aditi
20  21   Vaishali
21  22     Swarna
22  23     Devesh
23  24    Purnima
24  25     Arvind
25  26     Diksha
26  27    Santosh

In [49]:
df = pd.read_csv("attendance.csv",header=None)

In [50]:
def get_id(text):
    return text.split("\t")[0]
def get_time(text):
    return text.split("\t")[1]

In [66]:
df["id"]= df[0].map(get_id)
df["time"] = df[0].map(get_time)
df.drop(columns=[0],inplace=True)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443 entries, 0 to 442
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      443 non-null    object
 1   time    443 non-null    object
dtypes: object(2)
memory usage: 7.1+ KB

In [68]:
df.shape

(443, 2)

In [78]:
user_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      27 non-null     int64
 1   Name    27 non-null     object
dtypes: int64(1), object(1)
memory usage: 564.0+ bytes

In [82]:
df['id']= df["id"].astype(int)

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443 entries, 0 to 442
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      443 non-null    int64
 1   time    443 non-null    object
dtypes: int64(1), object(1)
memory usage: 7.1+ KB

In [86]:
data = pd.merge(df,user_df,how="inner",on="id")

In [87]:
data

     id                 time      Name
0     8  2024-12-02 08:39:37      Ajay
1     9  2024-12-02 09:04:17    Sachin
2    23  2024-12-02 09:17:46    Devesh
3    25  2024-12-02 09:33:58    Arvind
4    24  2024-12-02 09:54:28   Purnima
..   ..                  ...       ...
438  26  2024-12-31 10:29:05    Diksha
439   4  2024-12-31 10:44:18  Abhishek
440   1  2024-12-31 10:50:33    Saheba
441   5  2024-12-31 10:59:04   Kuldeep
442   9  2024-12-31 15:05:15    Sachin

[443 rows x 3 columns]

### data have been cleaned now it has to be reshaped as needed

In [117]:
data['datetime'] = pd.to_datetime(df['time'])
data['date'] = pd.to_datetime(df['time']).dt.date
data['timee'] = pd.to_datetime(df['time']).dt.time
data

,id,time,Name,datetime,date,timee
0,8,2024-12-02 08:39:37,Ajay,2024-12-02 08:39:37,2024-12-02,08:39:37
1,9,2024-12-02 09:04:17,Sachin,2024-12-02 09:04:17,2024-12-02,09:04:17
2,23,2024-12-02 09:17:46,Devesh,2024-12-02 09:17:46,2024-12-02,09:17:46
3,25,2024-12-02 09:33:58,Arvind,2024-12-02 09:33:58,2024-12-02,09:33:58
4,24,2024-12-02 09:54:28,Purnima,2024-12-02 09:54:28,2024-12-02,09:54:28
...,...,...,...,...,...,...
438,26,2024-12-31 10:29:05,Diksha,2024-12-31 10:29:05,2024-12-31,10:29:05
439,4,2024-12-31 10:44:18,Abhishek,2024-12-31 10:44:18,2024-12-31,10:44:18
440,1,2024-12-31 10:50:33,Saheba,2024-12-31 10:50:33,2024-12-31,10:50:33
441,5,2024-12-31 10:59:04,Kuldeep,2024-12-31 10:59:04,2024-12-31,10:59:04
442,9,2024-12-31 15:05:15,Sachin,2024-12-31 15:05:15,2024-12-31,15:05:15

In [119]:
data["am_pm"] = data['datetime'].dt.strftime("%p")
data_copy = data.copy()

In [122]:
data.drop(columns=["time",'datetime'],inplace=True)

In [144]:
ampm = data.pivot_table(index=data.index,columns='am_pm',values='timee',aggfunc="min")
ampm.reset_index(inplace=True)
ampm.rename(columns={"index":"row_id"},inplace=True)

In [148]:
data = data.reset_index().rename(columns={"index":"row_id"})

In [149]:
pd.merge(data,ampm,how='inner',on ='row_id')

     row_id  id      Name        date     timee am_pm        AM        PM
0         0   8      Ajay  2024-12-02  08:39:37    AM  08:39:37       NaN
1         1   9    Sachin  2024-12-02  09:04:17    AM  09:04:17       NaN
2         2  23    Devesh  2024-12-02  09:17:46    AM  09:17:46       NaN
3         3  25    Arvind  2024-12-02  09:33:58    AM  09:33:58       NaN
4         4  24   Purnima  2024-12-02  09:54:28    AM  09:54:28       NaN
..      ...  ..       ...         ...       ...   ...       ...       ...
438     438  26    Diksha  2024-12-31  10:29:05    AM  10:29:05       NaN
439     439   4  Abhishek  2024-12-31  10:44:18    AM  10:44:18       NaN
440     440   1    Saheba  2024-12-31  10:50:33    AM  10:50:33       NaN
441     441   5   Kuldeep  2024-12-31  10:59:04    AM  10:59:04       NaN
442     442   9    Sachin  2024-12-31  15:05:15    PM       NaN  15:05:15

[443 rows x 8 columns]

In [170]:
timesheet = pd.read_excel("timesheet.xlsx",sheet_name="Sheet1")

In [174]:
# pd.to_datetime(timesheet['max late']).dt.time
timesheet

        Name   In time  Out time  max late max early
0   Abhishek  11:00:00  20:30:00  11:10:00  20:20:00
1      Aditi  10:00:00  18:30:00  10:10:00  18:20:00
2    Santosh  09:00:00  18:00:00  09:10:00  17:50:00
3      Bantu  11:30:00  15:00:00  11:40:00  14:50:00
4    Purnima  10:00:00  18:30:00  10:10:00  18:20:00
5    Kuldeep  11:00:00  18:00:00  11:10:00  17:50:00
6     Sachin  09:00:00  18:00:00  09:10:00  17:50:00
7     Saheba  11:00:00  18:30:00  11:10:00  18:20:00
8     Diksha  10:30:00  18:30:00  10:40:00  18:20:00
9     Varun   09:30:00  18:00:00  09:40:00  17:50:00
10    Arvind  09:30:00  18:00:00  09:40:00  17:50:00
11    Devesh  09:30:00  18:00:00  09:40:00  17:50:00
12       Dev  11:00:00  20:30:00  11:10:00  20:20:00
13      Ajay  09:00:00  18:00:00  09:10:00  17:50:00